let RANKCOLOR = {}
let TIMEORDER = ['2012', '2013', '2014', '2015', '2016', '2017']
let PAGES = ['rank', 'map', 'time-number', 'time-rank', 'charge-eight', 'charges', 'prison-term']
RANKCOLOR['1'] = '#ebebeb'
RANKCOLOR['2'] = '#b0b0b0'
RANKCOLOR['3'] = '#757575'
RANKCOLOR['4'] = '#4a4a4a'
RANKCOLOR['5'] = '#000000'
RANKCOLOR['A'] = 'transparent'
RANKCOLOR['B'] = 'transparent'
RANKCOLOR['C'] = 'transparent'
const CHARGENAME = ['搞政治攀附', '妄议中央', '团团伙伙', '搞迷信活动', '对抗组织审查', '为子女谋利或子女受贿', '钱色交易、权色交易', '违规打高尔夫球']
const RANKORDER = ['正国级', '副国级', '正省/部级', '副省/部级', '军队落马将领', '中管']
const RANKOREDERMAP = ['正国级', '副国级', '正省/部级', '副省/部级', '中管干部', '军队']
const RANKCOLORMAP = ['#000000', '#4a4a4a', '#757575', '#b0b0b0', '#ebebeb', 'transparent']

let CHARGES = {}
CHARGES['对抗组织审查'] = {
  msg1: '<span class="info-name">自2015年底始，中央纪委对落马中管干部的党纪处理通报中，开始高频率地出现“对抗组织审查”。</span>',
  msg2: '甘肃原省委常委、副省长虞海燕在回头看期间，想方设法打探动向，联系和自己有利益往来的多名老板，商量对策，统一口径。如将和相关老板的合影剪碎冲进马桶，导致马桶被堵；其妻子交代在巡视期间，家里摆了一排手机，一个老板一个专号，在联系之后，用醋浸泡手机扔进黄河，还砸碎名贵手表等物品一并扔进黄河。'
}
CHARGES['为子女谋利或子女受贿'] = {
  msg1: '黑龙江省人大常委会副主任盖如垠之子盖阔，仰赖父辈荫蔽，借由同学、朋友代持，在大庆、哈尔滨、沈阳等地秘密经商，涉足酒类销售、广告传媒、道路工程、政府礼品采购等领域，甚至插手能源项目，在哈尔滨的节能改造中分得一杯羹。',
  msg2: '<span class="info-name">“盖阔刚开始做生意时候不想靠他爹，后来一试觉得不是那么回事，不靠他爹他啥生意都做不成。” （知情人士）<br>盖如垠主政大庆时，当地有多位地产开发商轮番给盖阔换车开，“一年能换好几辆车”。（知情人士）<span>'
}
CHARGES['钱色交易、权色交易'] = {
  msg1: '2014年6月，中央纪委在通报中国出口信用保险公司原副总经理戴春宁时，使用了“与他人通奸”的说法，涉及这一表述的还有河北省委原常委、秘书长景春华。此后，涉及个人生活作风的表述又有进行“钱色交易”“权色交易”等。',
  msg2: '根据中央纪委监察部官网，通奸是指双方或一方有配偶的男女自愿发生不正当性关系，造成不良影响的行为。'
}
CHARGES['搞迷信活动'] = {
  msg1: '',
  msg2: '2014年12月，黄兴国被任命为天津市委代理书记，为早日当上市委书记，黄兴国不仅结交过所谓的红顶商人，相信过骗子，还问过风水。天津市政府大院原本四个门都可以进出，近几年西北门却被封上，这是因为风水先生对黄兴国说“门开太多漏气，不聚气”。'
}
export {
  PAGES,
  CHARGENAME,
  RANKCOLOR,
  RANKORDER,
  RANKOREDERMAP,
  RANKCOLORMAP,
  CHARGES,
  TIMEORDER
}
